taskt/Core/Automation/Commands/WindowGroup/AWindowNamesActionCommnads.dot
digraph "AWindowNamesActionCommnads" {
"AWindowNamesActionCommnads" -> "AWindowNamesCommands";
"AWindowNamesActionCommnads" -> "IWindowNamesActionProperties";
"AWindowNamesCommands" -> "AWindowNameCoreCommands";
"AWindowNamesCommands" -> "IWindowNamesProperties";
"AWindowNamesCommands" -> "ICanHandleList";
"AWindowNameCoreCommands" -> "ScriptCommand";
"AWindowNameCoreCommands" -> "IWindowNameCoreProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
